app/graphql/types/query_type.rb

SELECT "series".* FROM "series" WHERE "series"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def series(id:)
      Series.find(id)