app/controllers/series_controller.rb

  def index
    @series = Series.all
---
SELECT "series".* FROM "series"

  def create
    @series = Series.new(series_params)

    respond_to do |format|
      if @series.save
---
INSERT INTO "series" ("name", "description", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Friends"], ["description", "It's about hmm, a group of friends"], ["rating", 5.0], ["created_at", "2020-07-30 21:48:09.739052"], ["updated_at", "2020-07-30 21:48:09.739052"]]

  def update
    respond_to do |format|
      if @series.update(series_params)
---
UPDATE "series" SET "picture" = ?, "updated_at" = ? WHERE "series"."id" = ?  [["picture", "Captura_de_tela_de_2020-07-11_08-56-47.png"], ["updated_at", "2020-07-28 21:23:09.468035"], ["id", 1]]

  def destroy
    @series.destroy
---
DELETE FROM "series" WHERE "series"."id" = ?  [["id", 1]]

    def set_series
      @series = Series.find(params[:id])
---
SELECT "series".* FROM "series" WHERE "series"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]